haymanmk/stm32f7xx_grbl/Core/Src/step.c
            // set all DMA updated flag
            generalNotification |= GENERAL_NOTIFICATION_ALL_AXES_DMA_UPDATED;

            // enable the master timer
            __HAL_TIM_ENABLE(&MASTER_TIM_HANDLE);

            // clear the flag
            generalNotification &= ~GENERAL_NOTIFICATION_DATA_NOT_AVAILABLE_ALL_AXES;
            generalNotification &= ~GENERAL_NOTIFICATION_FIRST_TIME_START;
        }
        // NOT the "First Time" to start the process, but out of data asking from the timer interrupt
        else
        {
            // set PD5 to high ===> signal the start of resuming DMA stream
            HAL_GPIO_WritePin(GPIOD, GPIO_PIN_5, GPIO_PIN_SET);

            // Determine if it should request for new data or not.
            if (currentStepperState == DMATransferCompletedAxes)
            {
                // get available address
                pulseBlockAddress = stepGetAvailableDataAddress();

                if (pulseBlockAddress == 0)
                {
                    // Error_Handler();
                    continue;
                }

                // clear DMA transfer completed axes
                DMATransferCompletedAxes = 0;
            }

            // update DMA buffer
            stepUpdateDMABuffer(pulseBlockAddress);

            // restart counter
            TIM_START_COUNTER(MASTER_TIM_HANDLE);

            // clear the flag
            generalNotification &= ~GENERAL_NOTIFICATION_DATA_NOT_AVAILABLE_ALL_AXES;

            // set PD5 to low ===> signal the end of resuming DMA stream
            HAL_GPIO_WritePin(GPIOD, GPIO_PIN_5, GPIO_PIN_RESET);
        }
    }
}

HAL_StatusTypeDef stepCalculatePulseData(uint32_t *st_addr)
{
    // set PD4 to high ===> signal the start of pulse calculation
    HAL_GPIO_WritePin(GPIOD, GPIO_PIN_4, GPIO_PIN_SET);

    static uint8_t getNewBuffer = (1 << NUM_DIMENSIONS) - 1; // bit 0: x axis, bit 1: y axis, bit 2: z axis
    static pulse_block_t *pulseBlock = {0};
    static pulse_t *pulse;
    static IO_TYPE dirOutputBits = 0;
    static uint32_t cycles_per_tick = 0;
    // static uint8_t amass_level = 0;

    stepper_t *st = (stepper_t *)st_addr;

    if (st->exec_segment)
    {
        // update variables
        cycles_per_tick = st->exec_segment->cycles_per_tick;
        // amass_level = st->exec_segment->amass_level;
    }

    if (!(st->step_pulse_time) || (st->exec_segment->cycles_per_tick == 0) || (st->exec_segment->cycles_per_tick == 0xffffffff))
    {
        // set PD4 to low ===> signal the end of pulse calculation
        HAL_GPIO_WritePin(GPIOD, GPIO_PIN_4, GPIO_PIN_RESET);

        return HAL_ERROR;
    }

    // determine if a new buffer is needed
    if (getNewBuffer || (dirOutputBits != st->dir_outbits) || (generalNotification & GENERAL_NOTIFICATION_GET_NEW_BUFFER))
    {
        // get new buffer from the ring buffer
        pulseBlock = (pulse_block_t *)stepGetFreeDataAddress();

        // check if the buffer is available
        if (pulseBlock == 0)
        {
            // set PD4 to low ===> signal the end of pulse calculation
            HAL_GPIO_WritePin(GPIOD, GPIO_PIN_4, GPIO_PIN_RESET);

            return HAL_BUSY;
        }

        // reset motion control state
        pulseBlock->motion_control_state = 0;

        // set direction state
        pulseBlock->dir_outbits = st->dir_outbits;

        // update direction output bits
        dirOutputBits = st->dir_outbits;

        // loop through all axes
        for (uint8_t i = 0; i < NUM_DIMENSIONS; i++)
        {
            // get pulse data
            pulse = &(pulseBlock->pulse_data[i]);

            // clear pulse length
            pulse->length = 0;
        }

        // clear the flag
        generalNotification &= ~GENERAL_NOTIFICATION_GET_NEW_BUFFER;
        getNewBuffer = 0;
    }

    // loop through all axes
    for (uint8_t i = 0; i < NUM_DIMENSIONS; i++)
    {
        // get timer and DMA parameters of this axis
        TIM_DMA_Parameters_t *timDMAParamsPulse = &axisTimerDMAParams[i];
        uint8_t step_bit = timDMAParamsPulse->Step_Bit;

        // get pulse data
        pulse = &(pulseBlock->pulse_data[i]);

        // determine if a pair of pulse data should be added in this axis or not by Bresenham line algorithm.
        // a pair of pulse data consists of a pulse data for the on state and a pulse data for the off state.
        uint16_t buf_length = pulse->length;

        if (st->step_outbits & (1 << step_bit))
        {
            // set this axis to ACTIVE state
            pulseBlock->motion_control_state |= (1 << i);

            // add pulse data
            // add ON state pulse data
            pulse->data[buf_length++] = currentCounterValue;
            // add OFF state pulse data
            pulse->data[buf_length++] = currentCounterValue + st->step_pulse_time;

            // update the length of available data
            pulse->length = buf_length;

            // check if the buffer is full
            if (buf_length >= DOUBLE_BUFFER_SIZE)
            {
                // set the flag to get new buffer
                getNewBuffer |= (1 << i);
            }
        }
    }

    // update variables
    currentCounterValue += cycles_per_tick; // * (amass_level + 1);

    // check if any buffer is full of data
    if (getNewBuffer)
    {
        // increment head
        stepRingBufferIncrementHead();

        // clear motion control state
        pulseRingBuffer[pulseRingBufferHead].motion_control_state = 0;
    }

    // set PD4 to low ===> signal the end of pulse calculation
    HAL_GPIO_WritePin(GPIOD, GPIO_PIN_4, GPIO_PIN_RESET);

    return HAL_OK;
}

void stepUpdateDMABuffer(uint32_t address)
{
    // set PD7 to high ===> signal the start of updating DMA buffer
    HAL_GPIO_WritePin(GPIOD, GPIO_PIN_7, GPIO_PIN_SET);

    pulse_block_t *pulseBlock = (pulse_block_t *)address;
    uint8_t upcomingAxesActiveState = pulseBlock->motion_control_state & (~blockedAxes); // get upcoming axes active state
    // check if there is any bit that is set to 0 in currentStepperState
    // and the corresponding bit is set to 1 in upcomingAxesActiveState.
    // make these axes which shall be re-enabled from idle
    uint8_t axisToBeReEnabled = (currentStepperState ^ upcomingAxesActiveState) & upcomingAxesActiveState;

    /**
     * Check if there is any axis that shall be re-enabled from idle, resume DMA stream, or turn into idle state
     */
    // manual update those axes that shall be re-enabled from idle and will stay in idle state in the upcoming cycle
    // to avoid update the same axis twice,
    // loop through all axes
    for (uint8_t i = 0; i < NUM_DIMENSIONS; i++)
    {
        // pulse data
        pulse_t *pulse = &(pulseBlock->pulse_data[i]);
        uint8_t dirOutputBit = GET_DIRECTION_BIT_FROM_AXIS(i);
        volatile uint32_t *pDirOutputPort = GET_DIRECTION_PORT_FROM_AXIS(i);

        // check if this axis shall be re-enabled from idle
        if (axisToBeReEnabled & (1 << i))
        {
            // set the axis to active
            currentStepperState |= (1 << i);

            // check if the address is valid
            if (address != 0)
            {
                // set the direction output bit according to the dir_outbit
                *pDirOutputPort = (*pDirOutputPort & ~(1 << dirOutputBit)) | (pulseBlock->dir_outbits & (1 << dirOutputBit));

                // force output turned into toggle mode
                SET_OC_OUTPUT_TOGGLE(axisTimerDMAParams[i].htim, axisTimerDMAParams[i].TIM_CHANNEL);

                // resume DMA stream with updated buffer and length
                // RESUME_DMA_STREAM_WITH_TC(axisTimerDMAParams[i].htim->hdma[axisTimerDMAParams[i].TIM_DMA_ID], (uint32_t *)pulse, pulse->length);
                HAL_StatusTypeDef status = stepTimeOCStartDMA(axisTimerDMAParams[i].htim, axisTimerDMAParams[i].TIM_CHANNEL, (uint32_t *)pulse, pulse->length);

                if (status == HAL_BUSY)
                {
                    RESUME_DMA_STREAM_WITH_TC(axisTimerDMAParams[i].htim->hdma[axisTimerDMAParams[i].TIM_DMA_ID], (uint32_t *)pulse, pulse->length);
                }

                // check if the capture/compare interrupt flag is set
                if (__HAL_TIM_GET_FLAG(axisTimerDMAParams[i].htim, axisTimerDMAParams[i].TIM_FLAG_CCx) == RESET)
                {
                    // generate compare event to trigger the DMA transfer
                    HAL_TIM_GenerateEvent(axisTimerDMAParams[i].htim, axisTimerDMAParams[i].CompareEventID);
                }
            }
            else
            {
                // should not reach here, because the 3-axis data is calculated simultaneously
                Error_Handler();
            }
        }
        else if ((currentStepperState & upcomingAxesActiveState) & (1 << i)) // active mode(present) -> active mode(upcoming)
        {
            // still in active state

            // resume the DMA stream
            // set the axis to active
            currentStepperState |= (1 << i);

            // set the direction output bit according to the dir_outbit
            *pDirOutputPort = (*pDirOutputPort & ~(1 << dirOutputBit)) | (pulseBlock->dir_outbits & (1 << dirOutputBit));

            // resume DMA stream with updated buffer and length
            HAL_StatusTypeDef status = stepTimeOCStartDMA(axisTimerDMAParams[i].htim, axisTimerDMAParams[i].TIM_CHANNEL, (uint32_t *)pulse, pulse->length);
            if (status == HAL_BUSY)
            {
                RESUME_DMA_STREAM_WITH_TC(axisTimerDMAParams[i].htim->hdma[GET_TIM_DMA_ID_FROM_AXIS(i)], (uint32_t *)pulse, pulse->length);
            }
        }
        else // idle mode(present) -> idle mode(upcoming) or active mode(present) -> idle mode(upcoming)
        {
            // turn into idle state

            // set the axis to idle
            currentStepperState &= ~(1 << i);

            // force output pin to low in output compare mode
            SET_OC_OUTPUT_LOW(axisTimerDMAParams[i].htim, axisTimerDMAParams[i].TIM_CHANNEL);
        }
    }

    /**
     * Update Variables
     */

    // set PD7 to low ===> signal the end of updating DMA buffer
    HAL_GPIO_WritePin(GPIOD, GPIO_PIN_7, GPIO_PIN_RESET);
}

